p2p-bench/results/run5/scenarios/ll128_p2p_on-c4/run_1.stdout.txt
WARNING 06-27 02:00:05 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a6a4db68360>, trust_remote_code=False, seed=1234, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='ll128_p2p_on-c4', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/ll128_p2p_on-c4', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-78707aa1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 02:00:09 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  1202.98   
Total input tokens:                      262144    
Total generated tokens:                  131072    
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         108.96    
Peak output token throughput (tok/s):    60.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          326.87    
---------------Time to First Token----------------
Mean TTFT (ms):                          8938.26   
Median TTFT (ms):                        8485.70   
P50 TTFT (ms):                           8485.70   
P90 TTFT (ms):                           10737.72  
P99 TTFT (ms):                           17077.44  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.98     
Median TPOT (ms):                        31.85     
P50 TPOT (ms):                           31.85     
P90 TPOT (ms):                           37.48     
P99 TPOT (ms):                           42.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           107.12    
Median ITL (ms):                         70.75     
P50 ITL (ms):                            70.75     
P90 ITL (ms):                            71.25     
P99 ITL (ms):                            79.20     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          74408.16  
Median E2EL (ms):                        74053.81  
P50 E2EL (ms):                           74053.81  
P90 E2EL (ms):                           86127.54  
P99 E2EL (ms):                           95533.96  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:44<05:08, 44.03s/it]
 25%|██▌       | 2/8 [00:46<01:55, 19.30s/it]
 38%|███▊      | 3/8 [00:46<00:52, 10.55s/it]
 50%|█████     | 4/8 [00:50<00:31,  7.99s/it]
 62%|██████▎   | 5/8 [01:28<00:56, 18.93s/it]
 75%|███████▌  | 6/8 [01:29<00:25, 12.96s/it]
 88%|████████▊ | 7/8 [01:32<00:09,  9.45s/it]
100%|██████████| 8/8 [01:39<00:00,  8.71s/it]
100%|██████████| 8/8 [01:39<00:00, 12.41s/it]

  0%|          | 0/64 [00:00<?, ?it/s]
  2%|▏         | 1/64 [00:53<56:25, 53.75s/it]
  3%|▎         | 2/64 [00:58<26:02, 25.21s/it]
  5%|▍         | 3/64 [01:14<20:56, 20.60s/it]
  6%|▋         | 4/64 [01:26<17:24, 17.41s/it]
  8%|▊         | 5/64 [01:51<19:43, 20.06s/it]
  9%|▉         | 6/64 [02:12<19:53, 20.58s/it]
 11%|█         | 7/64 [02:22<16:15, 17.12s/it]
 12%|█▎        | 8/64 [02:44<17:16, 18.51s/it]
 14%|█▍        | 9/64 [03:13<20:06, 21.93s/it]
 16%|█▌        | 10/64 [03:26<17:06, 19.00s/it]
 17%|█▋        | 11/64 [03:48<17:42, 20.05s/it]
 19%|█▉        | 12/64 [04:01<15:25, 17.81s/it]
 20%|██        | 13/64 [04:25<16:39, 19.60s/it]
 22%|██▏       | 14/64 [04:51<18:01, 21.64s/it]
 25%|██▌       | 16/64 [05:18<14:15, 17.83s/it]
 27%|██▋       | 17/64 [05:43<15:22, 19.64s/it]
 28%|██▊       | 18/64 [06:01<14:48, 19.31s/it]
 30%|██▉       | 19/64 [06:19<14:06, 18.80s/it]
 31%|███▏      | 20/64 [06:41<14:27, 19.72s/it]
 33%|███▎      | 21/64 [06:59<13:53, 19.37s/it]
 34%|███▍      | 22/64 [07:28<15:31, 22.17s/it]
 36%|███▌      | 23/64 [07:41<13:10, 19.29s/it]
 38%|███▊      | 24/64 [07:53<11:27, 17.20s/it]
 39%|███▉      | 25/64 [08:10<11:10, 17.19s/it]
 41%|████      | 26/64 [08:38<12:59, 20.51s/it]
 42%|████▏     | 27/64 [08:55<11:52, 19.26s/it]
 44%|████▍     | 28/64 [09:10<10:48, 18.01s/it]
 45%|████▌     | 29/64 [09:20<09:04, 15.56s/it]
 47%|████▋     | 30/64 [09:49<11:04, 19.54s/it]
 48%|████▊     | 31/64 [10:05<10:10, 18.50s/it]
 50%|█████     | 32/64 [10:26<10:22, 19.44s/it]
 52%|█████▏    | 33/64 [10:44<09:49, 19.03s/it]
 53%|█████▎    | 34/64 [10:59<08:55, 17.86s/it]
 55%|█████▍    | 35/64 [11:15<08:18, 17.20s/it]
 56%|█████▋    | 36/64 [11:50<10:29, 22.46s/it]
 58%|█████▊    | 37/64 [11:59<08:22, 18.63s/it]
 59%|█████▉    | 38/64 [12:17<07:52, 18.16s/it]
 61%|██████    | 39/64 [12:26<06:26, 15.45s/it]
 62%|██████▎   | 40/64 [13:00<08:24, 21.01s/it]
 64%|██████▍   | 41/64 [13:09<06:42, 17.51s/it]
 66%|██████▌   | 42/64 [13:38<07:38, 20.84s/it]
 67%|██████▋   | 43/64 [13:46<06:00, 17.18s/it]
 69%|██████▉   | 44/64 [14:10<06:20, 19.03s/it]
 70%|███████   | 45/64 [14:34<06:32, 20.67s/it]
 72%|███████▏  | 46/64 [14:48<05:33, 18.53s/it]
 73%|███████▎  | 47/64 [15:09<05:30, 19.42s/it]
 75%|███████▌  | 48/64 [15:20<04:29, 16.86s/it]
 77%|███████▋  | 49/64 [15:52<05:21, 21.41s/it]
 78%|███████▊  | 50/64 [16:12<04:55, 21.08s/it]
 80%|███████▉  | 51/64 [16:29<04:17, 19.84s/it]
 81%|████████▏ | 52/64 [16:43<03:36, 18.07s/it]
 83%|████████▎ | 53/64 [17:04<03:27, 18.82s/it]
 84%|████████▍ | 54/64 [17:37<03:50, 23.01s/it]
 88%|████████▊ | 56/64 [18:00<02:21, 17.74s/it]
 89%|████████▉ | 57/64 [18:22<02:11, 18.78s/it]
 91%|█████████ | 58/64 [18:46<02:01, 20.33s/it]
 92%|█████████▏| 59/64 [19:07<01:42, 20.40s/it]
 94%|█████████▍| 60/64 [19:22<01:15, 18.95s/it]
 95%|█████████▌| 61/64 [19:33<00:49, 16.57s/it]
 97%|█████████▋| 62/64 [19:49<00:32, 16.33s/it]
 98%|█████████▊| 63/64 [19:57<00:13, 13.96s/it]
100%|██████████| 64/64 [20:02<00:00, 11.51s/it]
100%|██████████| 64/64 [20:02<00:00, 18.80s/it]